# ========== Страны и языки ===========

def import_dict(file_path) -> dict:
    """ Вводим текст из удалённого файла (ссылка на файл, str)
        Выдаём словарь (dict):
        Ключ: язык (str)
        Значение: страна(ы) (str)
    """
    pass

def find_countries(language) -> str:
    """ Получает имя языка (str)
        Выдаёт страну(ы) (str)
    """
    pass

def get_lang_list():
    """ Пользовательский ввод языков:
        Получает размер списка
        Получает поочерёдно названия языков
        Выводит список стран
    """
    pass